In [5]:
import pandas as pd

In [2]:
data = {
    'Name':['Pandy','Bamboo','Fuzzy'],
    'Age':[5,7,4],
    'Bamboo_Sticks':[15,16,20]
}
df = pd.DataFrame(data)

In [3]:
print(df)

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [4]:
df

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [5]:
df.head() #Will display the first 5 rows of the DataFrame

     Name  Age  Bamboo_Sticks
0   Pandy    5             15
1  Bamboo    7             16
2   Fuzzy    4             20

In [6]:
#Filtering Data with the age  less than 6
print(df['Age']<6)
df[df['Age']<6] #First DF is Pulling All data associated with the condition

0     True
1    False
2     True
Name: Age, dtype: bool

    Name  Age  Bamboo_Sticks
0  Pandy    5             15
2  Fuzzy    4             20

In [7]:
df['Job']=['Intern','Manager','Intern']
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    5             15   Intern
1  Bamboo    7             16  Manager
2   Fuzzy    4             20   Intern

In [8]:
df.loc[df['Name']=='Pandy','Age']=6  #Changing the age of Pandy to 6
df

     Name  Age  Bamboo_Sticks      Job
0   Pandy    6             15   Intern
1  Bamboo    7             16  Manager
2   Fuzzy    4             20   Intern

In [9]:
df=df.drop('Bamboo_Sticks',axis=1) #Axis 1 is used to drop a column. By default Axis is 0 which is used to drop rows.

In [10]:
print(df)

     Name  Age      Job
0   Pandy    6   Intern
1  Bamboo    7  Manager
2   Fuzzy    4   Intern

In [11]:
df.iloc[0] #iloc is index location. iloc[0] is used to show row 0

Name     Pandy
Age          6
Job     Intern
Name: 0, dtype: object

In [12]:
df["Age"]

0    6
1    7
2    4
Name: Age, dtype: int64

In [13]:
df.iloc[0:2, 0:2] #0:2 means first two rows, 0:2 means second and third columns

     Name  Age
0   Pandy    6
1  Bamboo    7

In [20]:
df=pd.DataFrame({
    'Name' : ['Pandy','Bamboo','Fuzzy',"Fluffy"],
    'Age' : [5,7,4,6],
    'Bamboo_Sticks' : [15,16,20,18]
},index = ['a','b','c','d'])

In [21]:
print(df)

     Name  Age  Bamboo_Sticks
a   Pandy    5             15
b  Bamboo    7             16
c   Fuzzy    4             20
d  Fluffy    6             18

In [22]:
df.loc['b']

Name             Bamboo
Age                   7
Bamboo_Sticks        16
Name: b, dtype: object

In [24]:
df.loc[['a','c'],['Name','Age']]

    Name  Age
a  Pandy    5
c  Fuzzy    4

In [27]:
df_json= pd.read_json('test.json')

In [28]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [29]:
df_json.shape #Row and Column Number.

(6, 4)

In [31]:
df_json.to_csv('Converted to CSV.csv', index=False)

In [33]:
df_csv = pd.read_csv('Converted to CSV.csv')

In [34]:
df_csv.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479

In [37]:
df_csv = df_csv.drop('Calories', axis =1)

In [38]:
df_csv

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

In [39]:
df_csv.to_excel('output.xlsx', index=False) #Saving into Excel

In [40]:
df_csv[['Duration','Pulse']] #For filtering this 2 columns

   Duration  Pulse
0        60    110
1        60    117
2        60    103
3        45    109
4        45    117
5        60    102

In [42]:
df_csv[(df_csv["Duration"]>50) & (df_csv["Pulse"]>105)]

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145

In [11]:
#Merging 2 Dataframes:
left=pd.DataFrame({
    'ID':[1,2,3],
    'Name':['Pandy', 'Fuzzy','Bamboo']
})

right=pd.DataFrame({
    'ID': [1,2,4],
    'Hobby':['Climbing','Sleeping','Eating']
})

marged_df=pd.merge(left, right, on= 'ID', how='left') #On is used to Define based on Which you are gonna Merge.
#How is used to define the type of Join inner, outer,left,right Same as SQL

print(marged_df)

   ID    Name     Hobby
0   1   Pandy  Climbing
1   2   Fuzzy  Sleeping
2   3  Bamboo       NaN

In [16]:
# Concatenation in Row:
concated_df= pd.concat( [left,right], ignore_index=True)
concated_df

   ID    Name     Hobby
0   1   Pandy       NaN
1   2   Fuzzy       NaN
2   3  Bamboo       NaN
3   1     NaN  Climbing
4   2     NaN  Sleeping
5   4     NaN    Eating

In [15]:
#Concatanation in column:
concated_df= pd.concat( [left,right], axis=1)
concated_df

   ID    Name  ID     Hobby
0   1   Pandy   1  Climbing
1   2   Fuzzy   2  Sleeping
2   3  Bamboo   4    Eating